---
kind: property
id: P:Autodesk.Revit.DB.TextRange.Start
source: html/2785da77-9e08-02e3-fb2e-ad02c9d7d96f.htm
---
# Autodesk.Revit.DB.TextRange.Start Property

The start index of a range within the FormattedText .

## Syntax (C#)
```csharp
public int Start { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for start is negative.